[
  ["Back to Exhibitor Search >>"],
  ["Company Name:", "PRATIBHA SYNTEX LTD"],
  ["Booth Number: H10:004", "Hall Number: Hall 10"],
  [
    "Address:",
    "Plot No 4, Industrial Growth Centre, Kheda, Pithampur, Dhar 454774 Madhya Pradesh India"
  ],
  ["Telephone: 91-731-4267900", "Mobile: 91-9685411222"],
  [
    "Email ID: communications@pratibhasyntex.com",
    "Website: www.pratibhasyntex.com"
  ],
  [
    "Contact Person: Niti Parikh",
    "Designation: Head Corporate Communications & Csr"
  ],
  ["Brand Name:", ""],
  [
    "Product Group: Apparel & Fashion",
    "Product Categories: Casual Wear: T-shirts/polo Shirts, Formal/business Wear: Sweat Shirts, Knitwear, Children Wear: Infants Wear, Lingerie/underwear: Brief, Hosiery & Socks, Apparel: Apparel & Fashion: Other, Knit Wear : T-shirts, Hoodies, Underwear, Sleepwear, Thermals, Activewear, Fashion Tops And Knit Bottoms., High Fashion: Private Labels ?? Fashion, Highfashionandoccasionalwear: Other, Brands"
  ],
  [
    "Company Profile:",
    "Pratibha syntex is a large vertically integrated, sustainability oriented supplier of knitted textile products. Engineering a new business paradigm, the company streamlines the production from fiber to garment to reflect emerging sustainable values in textiles and fashion. Driven by a strong progressive vision, pratibha is committed to creating relationships across the value chain bringing together 25,000 farmers, 6500 employees, and renowned global apparel brands from over 40 countries. ?? cotton: pratibha’s organic farming project - vasudha is one of the largest of its kind. Engaging 25,000 farmers over 130,000 acres, 22,000 tonnes of organic, regenerative, fairtrade cotton is produced every year. ?? yarns: state-of-the-art facility manufactures 20,000 tonnes ring spun, compact, double, m?lange, airjet and open end yarns – all at one place. ?? fabrics: specializing in a variety of fabrics – single jersey, fleece, rib, pique, etc. Pratibha knits about 10,000 tonnes of open width and tubular fabric every year. Resource efficient fibre and fabric dyeing techniques help creating wide shades, considerate to the environment using cold-pad-batch dyeing & finishing that uses a third of the water and generates half the effluent. Further investment in biological effluent treatment system has completely eliminated the use of chemicals in water treatment and in the process of recycling waste salt from the dye bath. ?? garments: modern and compliant sewing factories are capable of producing 60 million pieces annually. Core products manufactured include underwear, sleepwear, thermals, activewear, fashion tops and knit bottoms."
  ],
  ["Participating at (Venue):", "Bharat Mandapam"],
  ["Back to Exhibitor Search >>"],
  ["Company Name:", "INDIAN DESIGNS EXPORTS PVT. LTD."],
  ["Booth Number: H10:005", "Hall Number: Hall 10"],
  ["Address:", "106/138, Nagawara Main Road, Bengaluru 560045 Karnataka India"],
  ["Telephone: 91-80-22947598", "Mobile: 91-7795955048"],
  ["Email ID: simi@indian-designs.com", "Website: www.indian-designs.com"],
  ["Contact Person: Simi Thilakan", "Designation: Design & Product Manager"],
  ["Brand Name:", "WE MANUFACTURE AND EXPORT GARMENTS OF US & UK BRANDS"],
  [
    "Product Group: Apparel & Fashion",
    "Product Categories: Casual Wear: Jeans/denim, Trousers, Shorts, Skirts, T-shirts/polo Shirts, Co-ordinates, Casual Wear: Other, Tops , Dresses , Jumpsuits ,shirts , Overalls, Children Wear: Boys Wear, Girls Wear, Infants Wear, Lingerie/underwear: Home Wear & Lounge Wear, Sleep Wear And Pyjamas, Apparel: Apparel & Fashion: Other, Menswear,womenswear,kidswear And Workwear"
  ],
  [
    "Company Profile:",
    "We are a manufacturing company that specializes in apparel and home furnishings. We began our journey in 1993,id has evolved into a design-driven company that manufactures a unique diversity of products from tops , dresses , outerwear and bottoms tapping into mens, womens and kids category in the apparel segment.In addition to servicing the apparel manufacturing needs of major international corporations, we have also partnered with many niche brands around the world and have grown together. We believe in significance, more than volumes. Building trustful relationships has always been our founding and operating principle."
  ],
  ["Participating at (Venue):", "Bharat Mandapam"]
]
